def qwerty_layout():
    """
    Создаем визуально раскладку Йцукен, со словарями
    layout (словарь с буквами и их положением (ряд и колонка)),
    home_positions (словарь с пальцем и его положением на домашнем ряду),
    finger_assignment (словарь с буквами и пальцем, которых их нажимает)

    Returns:
        Название раскладки, положение букв, домашний ряд и положение пальцев
    """

    layout = {
        'ё': (0, 0), '1': (0, 1), '2': (0, 2), '3': (0, 3), '4': (0, 4), '5': (0, 5),
        '6': (0, 6), '7': (0, 7), '8': (0, 8), '9': (0, 9), '0': (0, 10), '-': (0, 11),
        '=': (0, 12),
        'Ё': (0, 0), '!': (0, 1), '"': (0, 2), '№': (0, 3), ';': (0, 4), '%': (0, 5),
        ':': (0, 6), '?': (0, 7), '*': (0, 8), '(': (0, 9), ')': (0, 10),
        '_': (0, 11), '+': (0, 12),

        'й': (1, 1), 'ц': (1, 2), 'у': (1, 3), 'к': (1, 4), 'е': (1, 5), 'н': (1, 6),
        'г': (1, 7), 'ш': (1, 8), 'щ': (1, 9), 'з': (1, 10), 'х': (1, 11), 'ъ': (1, 12),
        'Й': (1, 1), 'Ц': (1, 2), 'У': (1, 3), 'К': (1, 4), 'Е': (1, 5), 'Н': (1, 6),
        'Г': (1, 7), 'Ш': (1, 8), 'Щ': (1, 9), 'З': (1, 10), 'Х': (1, 11), 'Ъ': (1, 12),

        'ф': (2, 1), 'ы': (2, 2), 'в': (2, 3), 'а': (2, 4), 'п': (2, 5), 'р': (2, 6),
        'о': (2, 7), 'л': (2, 8), 'д': (2, 9), 'ж': (2, 10), 'э': (2, 11),
        'Ф': (2, 1), 'Ы': (2, 2), 'В': (2, 3), 'А': (2, 4), 'П': (2, 5), 'Р': (2, 6),
        'О': (2, 7), 'Л': (2, 8), 'Д': (2, 9), 'Ж': (2, 10), 'Э': (2, 11),

        'я': (3, 1), 'ч': (3, 2), 'с': (3, 3), 'м': (3, 4), 'и': (3, 5), 'т': (3, 6),
        'ь': (3, 7), 'б': (3, 8), 'ю': (3, 9), '.': (3, 10),
        'Я': (3, 1), 'Ч': (3, 2), 'С': (3, 3), 'М': (3, 4), 'И': (3, 5), 'Т': (3, 6),
        'Ь': (3, 7), 'Б': (3, 8), 'Ю': (3, 9), ',': (3, 10),

        ' ': (4, 3), 'space': (4, 5),

        'shift': (3, 0),
        'SHIFT': (3, 11),
        'enter': (2, 12)
    }

    home_positions = {
        'f5l': (2, 1),
        'f4l': (2, 2),
        'f3l': (2, 3),
        'f2l': (2, 4),
        'f1l': (4, 3),
        'f1r': (4, 5),
        'f2r': (2, 7),
        'f3r': (2, 8),
        'f4r': (2, 9),
        'f5r': (2, 10)
    }

    finger_assignment = {
        'й': 'f5l', 'ц': 'f4l', 'у': 'f3l', 'к': 'f2l', 'е': 'f2l',
        'ф': 'f5l', 'ы': 'f4l', 'в': 'f3l', 'а': 'f2l', 'п': 'f2l',
        'я': 'f5l', 'ч': 'f4l', 'с': 'f3l', 'м': 'f2l', 'и': 'f2l',

        'н': 'f2r', 'г': 'f2r', 'ш': 'f3r', 'щ': 'f4r', 'з': 'f5r', 'х': 'f5r', 'ъ': 'f5r',
        'р': 'f2r', 'о': 'f2r', 'л': 'f3r', 'д': 'f4r', 'ж': 'f5r', 'э': 'f5r',
        'т': 'f2r', 'ь': 'f2r', 'б': 'f3r', 'ю': 'f4r', '.': 'f5r',

        'Й': 'f5l', 'Ц': 'f4l', 'У': 'f3l', 'К': 'f2l', 'Е': 'f2l',
        'Ф': 'f5l', 'Ы': 'f4l', 'В': 'f3l', 'А': 'f2l', 'П': 'f2l',
        'Я': 'f5l', 'Ч': 'f4l', 'С': 'f3l', 'М': 'f2l', 'И': 'f2l',

        'Н': 'f2r', 'Г': 'f2r', 'Ш': 'f3r', 'Щ': 'f4r', 'З': 'f5r', 'Х': 'f5r', 'Ъ': 'f5r',
        'Р': 'f2r', 'О': 'f2r', 'Л': 'f3r', 'Д': 'f4r', 'Ж': 'f5r', 'Э': 'f5r',
        'Т': 'f2r', 'Ь': 'f2r', 'Б': 'f3r', 'Ю': 'f4r', ',': 'f5r',

        'ё': 'f5l', 'Ё': 'f5l', '1': 'f5l', '2': 'f4l', '3': 'f3l', '4': 'f2l', '5': 'f2l',
        '6': 'f2r', '7': 'f2r', '8': 'f3r', '9': 'f4r', '0': 'f5r', '-': 'f5r', '=': 'f5r',
        '!': 'f5l', '"': 'f4l', '№': 'f3l', ';': 'f2l', '%': 'f2l', ':': 'f2r', '?': 'f2r',
        '*': 'f3r', '(': 'f4r', ')': 'f5r', '_': 'f5r', '+': 'f5r',

        ' ': 'f1l', 'space': 'f1r',

        'shift': 'f5l',
        'SHIFT': 'f5r',
        'enter': 'f5r'
    }

    return {
        'name': 'Йцукен',
        'layout': layout,
        'home_positions': home_positions,
        'finger_assignment': finger_assignment
    }


def dictor_layout():
    """
    Создаем визуально раскладку Диктор, со словарями
    layout (словарь с буквами и их положением (ряд и колонка)),
    home_positions (словарь с пальцем и его положением на домашнем ряду),
    finger_assignment (словарь с буквами и пальцем, которых их нажимает)

    Returns:
        Название раскладки, положение букв, домашний ряд и положение пальцев
    """
    layout = {
        'ё': (0, 0), '1': (0, 1), '2': (0, 2), '3': (0, 3), '4': (0, 4), '5': (0, 5),
        '6': (0, 6), '7': (0, 7), '8': (0, 8), '9': (0, 9), '0': (0, 10), '*': (0, 11),
        '=': (0, 12),
        'Ё': (0, 0), 'Ъ': (0, 1), 'Ь': (0, 2), '№': (0, 3), '%': (0, 4), ':': (0, 5),
        ';': (0, 6), '-': (0, 7), '"': (0, 8), '(': (0, 9), ')': (0, 10),
        '_': (0, 11), '+': (0, 12),

        'ц': (1, 1), 'ь': (1, 2), 'я': (1, 3), ',': (1, 4), '.': (1, 5), 'з': (1, 6),
        'в': (1, 7), 'к': (1, 8), 'д': (1, 9), 'ч': (1, 10), 'ш': (1, 11), 'щ': (1, 12),
        'Ц': (1, 1), 'ъ': (1, 2), 'Я': (1, 3), '?': (1, 4), '!': (1, 5), 'З': (1, 6),
        'В': (1, 7), 'К': (1, 8), 'Д': (1, 9), 'Ч': (1, 10), 'Ш': (1, 11), 'Щ': (1, 12),

        'у': (2, 1), 'и': (2, 2), 'е': (2, 3), 'о': (2, 4), 'а': (2, 5), 'л': (2, 6),
        'н': (2, 7), 'т': (2, 8), 'с': (2, 9), 'р': (2, 10), 'й': (2, 11),
        'У': (2, 1), 'И': (2, 2), 'Е': (2, 3), 'О': (2, 4), 'А': (2, 5), 'Л': (2, 6),
        'Н': (2, 7), 'Т': (2, 8), 'С': (2, 9), 'Р': (2, 10), 'Й': (2, 11),

        'ф': (3, 1), 'э': (3, 2), 'х': (3, 3), 'ы': (3, 4), 'ю': (3, 5), 'б': (3, 6),
        'м': (3, 7), 'п': (3, 8), 'г': (3, 9), 'ж': (3, 10),
        'Ф': (3, 1), 'Э': (3, 2), 'Х': (3, 3), 'Ы': (3, 4), 'Ю': (3, 5), 'Б': (3, 6),
        'М': (3, 7), 'П': (3, 8), 'Г': (3, 9), 'Ж': (3, 10),

        ' ': (4, 3), 'space': (4, 5),

        'shift': (3, 0),
        'SHIFT': (3, 11),
        'enter': (2, 12)
    }

    home_positions = {
        'f5l': (2, 1),
        'f4l': (2, 2),
        'f3l': (2, 3),
        'f2l': (2, 4),
        'f1l': (4, 3),
        'f1r': (4, 5),
        'f2r': (2, 7),
        'f3r': (2, 8),
        'f4r': (2, 9),
        'f5r': (2, 10)
    }

    finger_assignment = {
        'ц': 'f5l', 'ь': 'f4l', 'я': 'f3l', ',': 'f2l', '.': 'f2l',
        'у': 'f5l', 'и': 'f4l', 'е': 'f3l', 'о': 'f2l', 'а': 'f2l',
        'ф': 'f5l', 'э': 'f4l', 'х': 'f3l', 'ы': 'f2l', 'ю': 'f2l',

        'з': 'f2r', 'в': 'f2r', 'к': 'f3r', 'д': 'f4r', 'ч': 'f5r', 'ш': 'f5r',
        'щ': 'f5r',
        'л': 'f2r', 'н': 'f2r', 'т': 'f3r', 'с': 'f4r', 'р': 'f5r', 'й': 'f5r',
        'б': 'f2r', 'м': 'f2r', 'п': 'f3r', 'г': 'f4r', 'ж': 'f5r',

        'Ц': 'f5l', 'ъ': 'f4l', 'Я': 'f3l', '?': 'f2l', '!': 'f2l',
        'У': 'f5l', 'И': 'f4l', 'Е': 'f3l', 'О': 'f2l', 'А': 'f2l',
        'Ф': 'f5l', 'Э': 'f4l', 'Х': 'f3l', 'Ы': 'f2l', 'Ю': 'f2l',

        'З': 'f2r', 'В': 'f2r', 'К': 'f3r', 'Д': 'f4r', 'Ч': 'f5r', 'Ш': 'f5r',
        'Щ': 'f5r',
        'Л': 'f2r', 'Н': 'f2r', 'Т': 'f3r', 'С': 'f4r', 'Р': 'f5r', 'Й': 'f5r',
        'Б': 'f2r', 'М': 'f2r', 'П': 'f3r', 'Г': 'f4r', 'Ж': 'f5r',

        'ё': 'f5l', '1': 'f5l', '2': 'f4l', '3': 'f3l', '4': 'f2l',
        '5': 'f2l', '6': 'f2r', '7': 'f2r', '8': 'f3r', '9': 'f4r',
        '0': 'f5r', '*': 'f5r', '=': 'f5r',
        'Ё': 'f5l', 'Ъ': 'f5l', 'Ь': 'f4l', '№': 'f3l', '%': 'f2l',
        ':': 'f2l', ';': 'f2r', '-': 'f2r', '"': 'f3r', '(': 'f4r',
        ')': 'f5r', '_': 'f5r', '+': 'f5r',

        ' ': 'f1l', 'space': 'f1r',

        'shift': 'f5l',
        'SHIFT': 'f5r',
        'enter': 'f5r'
    }

    return {
        'name': 'Диктор',
        'layout': layout,
        'home_positions': home_positions,
        'finger_assignment': finger_assignment
    }


def vizov_layout():
    """
    Создаем визуально раскладку Вызов, со словарями
    layout (словарь с буквами и их положением (ряд и колонка)),
    home_positions (словарь с пальцем и его положением на домашнем ряду),
    finger_assignment (словарь с буквами и пальцем, которых их нажимает)

    Returns:
         Название раскладки, положение букв, домашний ряд, положение пальцев и символы при нажатии alt
    """
    layout = {
        '$': (0, 0), '%': (0, 1), '[': (0, 2), '{': (0, 3), '}': (0, 4), '(': (0, 5), '=': (0, 6), '*': (0, 7),
        ')': (0, 8), '+': (0, 9), ']': (0, 10), '!': (0, 11), 'щ': (0, 12),
        '~': (0, 0), '&': (0, 1), '7': (0, 2), '5': (0, 3), '3': (0, 4), '1': (0, 5), '9': (0, 6), '0': (0, 7),
        '2': (0, 8), '4': (0, 9), '6': (0, 10), '8': (0, 11), '#': (0, 12),

        'в': (1, 1), 'ы': (1, 2), 'о': (1, 3), 'у': (1, 4), 'ь': (1, 5), 'ё': (1, 6), 'л': (1, 7), 'д': (1, 8),
        'я': (1, 9), 'г': (1, 10), 'ж': (1, 11), 'ц': (1, 12),
        'В': (1, 1), 'Ы': (1, 2), 'О': (1, 3), 'У': (1, 4), "'": (1, 5), '"': (1, 6), 'Л': (1, 7), 'Д': (1, 8),
        'Я': (1, 9), 'Г': (1, 10), 'Ж': (1, 11), '@': (1, 12),
        'ю': (1, 4),

        'ч': (2, 1), 'и': (2, 2), 'е': (2, 3), 'а': (2, 4), ',': (2, 5), '.': (2, 6), 'н': (2, 7), 'т': (2, 8),
        'с': (2, 9), 'б': (2, 10), 'з': (2, 11),
        'Ч': (2, 1), 'И': (2, 2), 'Е': (2, 3), 'А': (2, 4), ';': (2, 5), ':': (2, 6), 'Н': (2, 7), 'Т': (2, 8),
        'С': (2, 9), 'Б': (2, 10), 'З': (2, 11),
        'э': (2, 3), 'ъ': (2, 8), '№': (2, 10),

        'ш': (3, 1), 'х': (3, 2), 'й': (3, 3), 'к': (3, 4), '_': (3, 5), '/': (3, 6), 'р': (3, 7), 'м': (3, 8),
        'ф': (3, 9), 'п': (3, 10),
        'Ш': (3, 1), 'Х': (3, 2), 'Й': (3, 3), 'К': (3, 4), '-': (3, 5), '?': (3, 6), 'Р': (3, 7), 'М': (3, 8),
        'Ф': (3, 9), 'П': (3, 10),

        ' ': (4, 3), 'alt': (4, 4),

        'shift': (3, 0),
        'SHIFT': (3, 11),
        'enter': (2, 12)
    }

    home_positions = {
        'f5l': (2, 1),
        'f4l': (2, 2),
        'f3l': (2, 3),
        'f2l': (2, 4),
        'f1l': (4, 3),
        'f1r': (4, 4),
        'f2r': (2, 7),
        'f3r': (2, 8),
        'f4r': (2, 9),
        'f5r': (2, 10)
    }

    finger_assignment = {
        '$': 'f5l', '%': 'f5l', '[': 'f4l', '{': 'f3l', '}': 'f2l', '(': 'f2l', '=': 'f2r', '*': 'f2r',
        ')': 'f3r', '+': 'f4r', ']': 'f5r', '!': 'f5r', 'щ': 'f5r',
        '~': 'f5l', '&': 'f5l', '7': 'f4l', '5': 'f3l', '3': 'f2l', '1': 'f2l', '9': 'f2r', '0': 'f2r',
        '2': 'f3r', '4': 'f4r', '6': 'f5r', '8': 'f5r', '#': 'f5r',

        'в': 'f5l', 'ы': 'f4l', 'о': 'f3l', 'у': 'f2l', 'ь': 'f2l', 'ё': 'f2r', 'л': 'f2r', 'д': 'f3r',
        'я': 'f4r', 'г': 'f5r', 'ж': 'f5r', 'ц': 'f5r',
        'В': 'f5l', 'Ы': 'f4l', 'О': 'f3l', 'У': 'f2l', "'": 'f2l', '"': 'f2r', 'Л': 'f2r', 'Д': 'f3r',
        'Я': 'f4r', 'Г': 'f5r', 'Ж': 'f5r', '@': 'f5r',
        'ю': 'f2l',

        'ч': 'f5l', 'и': 'f4l', 'е': 'f3l', 'а': 'f2l', ',': 'f2l', '.': 'f2r', 'н': 'f2r', 'т': 'f3r',
        'с': 'f4r', 'б': 'f5r', 'з': 'f5r',
        'Ч': 'f5l', 'И': 'f4l', 'Е': 'f3l', 'А': 'f2l', ';': 'f2l', ':': 'f2r', 'Н': 'f2r', 'Т': 'f3r',
        'С': 'f4r', 'Б': 'f5r', 'З': 'f5r',
        'э': 'f3l', 'ъ': 'f3r', '№': 'f5r',

        'ш': 'f5l', 'х': 'f4l', 'й': 'f3l', 'к': 'f2l', '_': 'f2l', '/': 'f2r', 'р': 'f2r', 'м': 'f3r',
        'ф': 'f4r', 'п': 'f5r',
        'Ш': 'f5l', 'Х': 'f4l', 'Й': 'f3l', 'К': 'f2l', '-': 'f2l', '?': 'f2r', 'Р': 'f2r', 'М': 'f3r',
        'Ф': 'f4r', 'П': 'f5r',

        ' ': 'f1l', 'alt': 'f1r',

        'shift': 'f5l',
        'SHIFT': 'f5r',
        'enter': 'f5r'
    }

    alt_symbols = {
        'ю', 'э', 'ъ', '№'
    }

    return {
        'name': 'Вызов',
        'layout': layout,
        'home_positions': home_positions,
        'finger_assignment': finger_assignment,
        'alt_symbols': alt_symbols
    }